{"config": [{"config": {"arguments": {}, "batch_input_shape": [null, 14, 64, 1], "name": "lambda_1", "function_type": "lambda", "input_dtype": "float32", "trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-16-e4ea3e9b6c0b>\u00da\b<lambda>\u0007\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"nb_col": 3, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_filter": 2, "subsample": [1, 1], "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 14, 64, 1], "W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "init": "glorot_uniform", "name": "convolution2d_1", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [4, 4], "name": "maxpooling2d_1", "border_mode": "valid", "strides": [4, 4], "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias": true, "activation": "linear", "output_dim": 1, "b_constraint": null, "trainable": true, "W_regularizer": null, "input_dim": 90, "init": "glorot_uniform", "name": "dense_1", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.2", "class_name": "Sequential"}