{"config": [{"config": {"arguments": {}, "output_shape_type": "raw", "trainable": true, "dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-3-00a497fca112>\u00da\b<lambda>\n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 14, 32, 1]}, "class_name": "Lambda"}, {"config": {"kernel_size": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_1", "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "batch_input_shape": [null, 14, 32, 1], "trainable": true, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "use_bias": true, "data_format": "channels_last", "filters": 1}, "class_name": "Conv2D"}, {"config": {"pool_size": [4, 4], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "units": 1, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6"}