{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "trainable": true, "output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "input_dtype": "float32", "batch_input_shape": [null, 14, 32, 1], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>$\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "bias": true, "activation": "relu", "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "batch_input_shape": [null, 14, 32, 1], "nb_col": 3, "name": "convolution2d_1", "nb_filter": 2, "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "trainable": true, "pool_size": [5, 5], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "output_dim": 1, "input_dim": 28, "name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}]}