{"config": [{"config": {"function_type": "lambda", "trainable": true, "input_dtype": "float32", "output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "batch_input_shape": [null, 14, 32, 1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-cf7781df8226>\u00da\b<lambda>\u0007\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}, "class_name": "Lambda"}, {"config": {"batch_input_shape": [null, 14, 32, 1], "trainable": true, "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "bias": true, "nb_filter": 2, "subsample": [1, 1], "input_dtype": "float32", "dim_ordering": "tf", "W_constraint": null, "nb_col": 3, "name": "convolution2d_1", "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "nb_row": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [4, 4], "trainable": true, "dim_ordering": "tf", "pool_size": [4, 4], "name": "maxpooling2d_1", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 1, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": 42, "W_constraint": null, "name": "dense_1", "W_regularizer": null, "b_regularizer": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.2"}