{"keras_version": "2.0.6", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"dtype": "float32", "trainable": true, "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 14, 32, 1], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-3-94954a11bd8d>\u00da\b<lambda>\n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Conv2D", "config": {"dtype": "float32", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "padding": "valid", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "batch_input_shape": [null, 14, 32, 1], "filters": 2, "name": "conv2d_1", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [5, 5], "strides": [4, 4], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 1, "name": "dense_1"}}], "backend": "tensorflow"}